# StandardStairsId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..StandardStairsId Property
MultistoryStairs Class See Also
---
Id of the stair associated with the Reference Level for the multistory stairs. The standard stair is regarded as a definition to generate new stairs when extending multistory stairs to a different level height.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ElementId StandardStairsId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StandardStairsId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ StandardStairsId {
	ElementId^ get ();
}
```

# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace